In [1]:
#SQL
#Pandas can read and write to various SQL engines through the use of both a driver and then the SQLAlchemy Python Library.

#As you may already be familiar with SQL comes in various engines like MySQL or PostgreSQL or Microsoft SQL Server.
#And the setup for all of these is a little different, and it also depends on what permissions you have, what the name of your database is and so on.

#So step number one is to figure out what SQL engine you're actually connecting to. For just a few examples, this could be something like PostgreSQL, MySQL, MS SQL Server, Oracle databases, et cetera.
#Step two is to then install the appropriate Python driver library. And often this just requires a quick Google search. So you would just Google search PostgreSQL plus Python, and you would quickly find that the appropriate Python driver for that is psycopg2 or MySQL is pymysql or MS SQL Server is pyodbc.
#Step three - you use SQLAlchemy Library to actually connect your SQL database with the driver.
#SQLAlchemy essentially just connects Python to your actual SQL engine. It makes that connection to the driver, that way Python in general can communicate with your SQL database.
#Step four - you can use that SQLAlchemy driver connection with the Pandas read_sql method. So essentially just passing that connection as a parameter into pd.read_sql.

#What's really nice about Pandas, it can both read in an entire table as a DataFrame, or if you want to use your SQL skills first, maybe you already know a little bit of SQL,
#you can actually pass in and parse an entire SQL query through that connection through Pandas and get only that subset of the results.

In [3]:
#We are gonna use SQLite

In [15]:
import pandas as pd
import numpy as np

In [ ]:
#SQLAlchemy can connect to a wide variety of SQL engines, and then basically once you've made that connection to that engine, you'll go ahead and pass in that connection to Pandas.

In [ ]:
#TO CREATE TEMPORARY DATABASE INSIDE OF YOUR RAM

In [9]:
from sqlalchemy import create_engine

In [13]:
temp_db = create_engine('sqlite:///:memory:')
#making the connection
#then i pass that connection to 'to_sql', to 'pd.read_sql' or to ''

In [25]:
df = pd.DataFrame(data = np.random.randint(low=0,high=100,size=(4,4)),columns= ['a','b','c','d'])
df

    a   b   c   d
0  47   3  39  35
1   5  39  69  19
2  76  62   8  44
3  69  53  29  83

In [27]:
df.to_sql(name='new_table', con= temp_db)
#'con' is the connection
#now i have a table into my database

#be aware of the existing tables in your db - you have the 'if_exists' for:
    # =fail --> raises a ValueError but doesnt overwrite it
    # =replace --> drop the table before inserting new values --> overwrites the existing one, be careful!
    # append --> insert new values to the existing table

4

In [29]:
#now that i have one table in my database, lets try to grab info or read from the SQL db
#Theres two ways:
#1 - read in an entire table at once

In [33]:
new_df = pd.read_sql(sql= 'new_table', con= temp_db)
new_df
#theres an extra column called 'index' cos i didnt put 'index=False' so i saved it with the index and now its an extra column

   index   a   b   c   d
0      0  47   3  39  35
1      1   5  39  69  19
2      2  76  62   8  44
3      3  69  53  29  83

In [37]:
#2 - pass in an entire SQL query in Pnadas - will perform that query and then return the results as a df
#requires to know SQL syntax

In [39]:
pd.read_sql_query(sql="SELECT a,c FROM new_table", con= temp_db)
#you do a prefiltering in SQL w SQL lenguage

    a   c
0  47  39
1   5  69
2  76   8
3  69  29